MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK61FN1M0CAA12/mcu.h
/****************************************************************************
**
** Copyright (C) 2025 MikroElektronika d.o.o.
** Contact: https://www.mikroe.com/contact
**
** This file is part of the mikroSDK package
**
** Commercial License Usage
**
** Licensees holding valid commercial NECTO compilers AI licenses may use this
** file in accordance with the commercial license agreement provided with the
** Software or, alternatively, in accordance with the terms contained in
** a written agreement between you and The MikroElektronika Company.
** For licensing terms and conditions see
** https://www.mikroe.com/legal/software-license-agreement.
** For further information use the contact form at
** https://www.mikroe.com/contact.
**
**
** GNU Lesser General Public License Usage
**
** Alternatively, this file may be used for
** non-commercial projects under the terms of the GNU Lesser
** General Public License version 3 as published by the Free Software
** Foundation: https://www.gnu.org/licenses/lgpl-3.0.html.
**
** The above copyright notice and this permission notice shall be
** included in all copies or substantial portions of the Software.
**
** THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
** EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
** OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
** IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
** DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT
** OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE
** OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
**
****************************************************************************/

#ifndef __MK61FN1M0CAA12_H__
#define __MK61FN1M0CAA12_H__



//*****************************************************************************
//
// Interrupt assignments
//
//*****************************************************************************

#define NUMBER_OF_INT_VECTORS                   120              // Number of interrupts in the Vector table
#define NotAvail_IRQn                           -107             // Not available device specific interrupt
#define NonMaskableInterrupt_IRQn               0                // Non-maskable Interrupt (NMI)
#define HardFault_IRQn                          1                // Hard Fault
#define MemManageFault_IRQn                     2                // MemManage Fault
#define BusFault_IRQn                           3                // Bus Fault
#define UsageFault_IRQn                         4                // Usage Fault
#define SVCall_IRQn                             9                // Supervisor call (SVCall)
#define DebugMonitor_IRQn                       10               // Debug Monitor
#define PendSV_IRQn                             12               // Pendable request for system service (PendableSrvReq)
#define SysTick_IRQn                            13               // System tick timer (SysTick)
#define DMA0_IRQn                               14               // DMA channel 0 transfer complete
#define DMA1_IRQn                               15               // DMA channel 1 transfer complete
#define DMA2_IRQn                               16               // DMA channel 2 transfer complete
#define DMA3_IRQn                               17               // DMA channel 3 transfer complete
#define DMA4_IRQn                               18               // DMA channel 4 transfer complete
#define DMA5_IRQn                               19               // DMA channel 5 transfer complete
#define DMA6_IRQn                               20               // DMA channel 6 transfer complete
#define DMA7_IRQn                               21               // DMA channel 7 transfer complete
#define DMA8_IRQn                               22               // DMA channel 8 transfer complete
#define DMA9_IRQn                               23               // DMA channel 9 transfer complete
#define DMA10_IRQn                              24               // DMA channel 10 transfer complete
#define DMA11_IRQn                              25               // DMA channel 11 transfer complete
#define DMA12_IRQn                              26               // DMA channel 12 transfer complete
#define DMA13_IRQn                              27               // DMA channel 13 transfer complete
#define DMA14_IRQn                              28               // DMA channel 14 transfer complete
#define DMA15_IRQn                              29               // DMA channel 15 transfer complete
#define DMA_Error_IRQn                          30               // DMA error interrupt channels 0-31
#define Normal_Interrupt_IRQn                   31               // Normal interrupt
#define Command_Complete_IRQn                   32               // Command complete
#define Read_Collision_IRQn                     33               // Read collision
#define PMC_IRQn                                34               // Low-voltage detect, low-voltage warning
#define LLWU_IRQn                               35               // Low Leakage Wakeup
#define Watchdog_Interrupt_IRQn                 36               // Watchdog interrupt
#define Randon_Number_Generator_IRQn            37               // Randon Number Generator
#define I2C0_IRQn                               38               // -
#define I2C1_IRQn                               39               // -
#define SPI0_IRQn                               40               // Single interrupt vector for all sources
#define SPI1_IRQn                               41               // Single interrupt vector for all sources
#define SPI2_IRQn                               42               // Single interrupt vector for all sources
#define CAN0_0Red_Message_buffer_IRQn           43               // OR'ed Message buffer (0-15)
#define CAN0_Bus_Off_IRQn                       44               // Bus Off
#define CAN0_Error_IRQn                         45               // Error
#define CAN0_Tx_Warning_IRQn                    46               // Transmit Warning
#define CAN0_Rx_Warning_IRQn                    47               // Receive Warning
#define CAN0_Wake_Up_IRQn                       48               // Wake Up
#define Transmit_IRQn                           49               // Transmit
#define Receive_IRQn                            50               // Receive
#define CAN1_0Red_Message_buffer_IRQn           51               // OR'ed Message buffer (0-15)
#define CAN1_Bus_Off_IRQn                       52               // Bus off
#define CAN1_Error_IRQn                         53               // Error
#define CAN1_Tx_Warning_IRQn                    54               // Transmit Warning
#define CAN1_Rx_Warning_IRQn                    55               // Receive Warning
#define CAN1_Wake_Up_IRQn                       56               // Wake Up
#define Single_Interrupt_Vector_For_UART_LON_SourceS_IRQn 58               // Single interrupt vector for UART LON sources
#define UART0_RX_TX_IRQn                        59               // Single interrupt vector for UART status sources
#define UART0_ERR_IRQn                          60               // Single interrupt vector for UART error sources
#define UART1_RX_TX_IRQn                        61               // Single interrupt vector for UART status sources
#define UART1_ERR_IRQn                          62               // Single interrupt vector for UART error sources
#define UART2_RX_TX_IRQn                        63               // Single interrupt vector for UART status sources
#define UART2_ERR_IRQn                          64               // Single interrupt vector for UART error sources
#define UART3_RX_TX_IRQn                        65               // Single interrupt vector for UART status sources
#define UART3_ERR_IRQn                          66               // Single interrupt vector for UART error sources
#define UART4_RX_TX_IRQn                        67               // Single interrupt vector for UART status sources
#define UART4_ERR_IRQn                          68               // Single interrupt vector for UART error sources
#define UART5_RX_TX_IRQn                        69               // Single interrupt vector for UART status sources
#define UART5_ERR_IRQn                          70               // Single interrupt vector for UART error sources
#define ADC0_IRQn                               71               // -
#define ADC1_IRQn                               72               // -
#define CMP0_IRQn                               73               // -
#define CMP1_IRQn                               74               // -
#define CMP2_IRQn                               75               // -
#define FTM0_IRQn                               76               // Single interrupt vector for all sources
#define FTM1_IRQn                               77               // Single interrupt vector for all sources
#define FTM2_IRQn                               78               // Single interrupt vector for all sources
#define CMT_IRQn                                79               // -
#define Alarm_Interrupt_IRQn                    80               // Alarm interrupt
#define Seconds_Interrupt_IRQn                  81               // Seconds interrupt
#define PIT0_IRQn                               82               // Channel 0
#define PIT1_IRQn                               83               // Channel 1
#define PIT2_IRQn                               84               // Channel 2
#define PIT3_IRQn                               85               // Channel 3
#define PDB_IRQn                                86               // -
#define USB_OTG_IRQn                            87               // -
#define USB_Charger_Detect_IRQn                 88               // -
#define IEEE_1588_Timer_Interrupt_IRQn          89               // IEEE 1588 Timer Interrupt
#define Transmit_Interrupt_IRQn                 90               // Transmit interrupt
#define Receive_Interrupt_IRQn                  91               // Receive interrupt
#define Error_And_Miscellaneous_Interrupt_IRQn  92               // Error and miscellaneous interrupt
#define SDHC_IRQn                               94               // -
#define DAC0_IRQn                               95               // -
#define DAC1_IRQn                               96               // -
#define Single_Interrupt_Vector_For_All_SourceS_IRQn 97               // Single interrupt vector for all sources
#define MCG_IRQn                                98               // -
#define LPTMR0_IRQn                             99               // -
#define PORTA_IRQn                              101              // Pin detect (Port A)
#define PORTB_IRQn                              102              // Pin detect (Port B)
#define PORTC_IRQn                              103              // Pin detect (Port C)
#define PORTD_IRQn                              104              // Pin detect (Port D)
#define PORTE_IRQn                              105              // Pin detect (Port E)
#define PORTF_IRQn                              106              // Pin detect (Port F)
#define Software_Interrupt_IRQn                 108              // Software interrupt
#define NAND_flash_controller_IRQn              109              // -
#define USB_HS_IRQn                             110              // -
#define CMP3_IRQn                               112              // -
#define FTM3_IRQn                               115              // Single interrupt vector for all sources
#define ADC2_IRQn                               116              // -
#define ADC3_IRQn                               117              // -
#define Transmit_IRQn                           118              // Transmit
#define Receive_IRQn                            119              // Receive



//*****************************************************************************
//
// Port Control and Interrupts (PORT) registers
//
//*****************************************************************************

