MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK61FN1M0CAA12/mcu.h
#define EEIn                          0x7FFFFFFF80000000      // Enable Error Interrupt n


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CEEI register.
//
//*****************************************************************************

#define NOP                           0x00000080      // No Op enable
#define CAEE                          0x00000040      // Clear All Enable Error Interrupts
#define Reserved                      0x00000020      // This field is reserved.
#define CEEI                          0x000001F0      // Clear Enable Error Interrupt


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_SEEI register.
//
//*****************************************************************************

#define NOP                           0x00000080      // No Op enable
#define SAEE                          0x00000040      // Sets All Enable Error Interrupts
#define Reserved                      0x00000020      // This field is reserved.
#define SEEI                          0x000001F0      // Set Enable Error Interrupt


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CERQ register.
//
//*****************************************************************************

#define NOP                           0x00000080      // No Op enable
#define CAER                          0x00000040      // Clear All Enable Requests
#define Reserved                      0x00000020      // This field is reserved.
#define CERQ                          0x000001F0      // Clear Enable Request


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_SERQ register.
//
//*****************************************************************************

#define NOP                           0x00000080      // No Op enable
#define SAER                          0x00000040      // Set All Enable Requests
#define Reserved                      0x00000020      // This field is reserved.
#define SERQ                          0x000001F0      // Set Enable Request


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CDNE register.
//
//*****************************************************************************

#define NOP                           0x00000080      // No Op enable
#define CADN                          0x00000040      // Clears All DONE Bits
#define Reserved                      0x00000020      // This field is reserved.
#define CDNE                          0x000001F0      // Clear DONE Bit


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_SSRT register.
//
//*****************************************************************************

#define NOP                           0x00000080      // No Op enable
#define SAST                          0x00000040      // Set All START Bits (activates all channels)
#define Reserved                      0x00000020      // This field is reserved.
#define SSRT                          0x000001F0      // Set START Bit


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CERR register.
//
//*****************************************************************************

#define NOP                           0x00000080      // No Op enable
#define CAEI                          0x00000040      // Clear All Error Indicators
#define Reserved                      0x00000020      // This field is reserved.
#define CERR                          0x000001F0      // Clear Error Indicator


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CINT register.
//
//*****************************************************************************

#define NOP                           0x00000080      // No Op enable
#define CAIR                          0x00000040      // Clear All Interrupt Requests
#define Reserved                      0x00000020      // This field is reserved.
#define CINT                          0x000001F0      // Clear Interrupt Request


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_INT register.
//
//*****************************************************************************

#define INTn                          0x7FFFFFFF80000000      // Interrupt Request n


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_ERR register.
//
//*****************************************************************************

#define ERRn                          0x7FFFFFFF80000000      // Error In Channel n


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_HRS register.
//
//*****************************************************************************

#define HRSn                          0x7FFFFFFF80000000      // Hardware Request Status Channel n


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_EARS register.
//
//*****************************************************************************

#define EDREQn                        0x7FFFFFFF80000000      // Enable asynchronous DMA request in stop mode for channel n


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_DCHPRIn register.
//
//*****************************************************************************

