MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK61FN1M0CAA12/mcu.h
#define ATME                          0x00000080      // Automatic Trim Machine Enable
#define ATMS                          0x00000040      // Automatic Trim Machine Select
#define ATMF                          0x00000020      // Automatic Trim Machine Fail Flag
#define FLTPRSRV                      0x00000010      // FLL Filter Preserve Enable
#define FCRDIV                        0x00000038      // Fast Clock Internal Reference Divider
#define LOCS0                         0x00000001      // OSC0 Loss of Clock Status


//*****************************************************************************
//
// The following are defines for the bit fields in the MCG_ATCVH register.
//
//*****************************************************************************

#define ATCVH                         0x00007F80      // ATM Compare Value High


//*****************************************************************************
//
// The following are defines for the bit fields in the MCG_ATCVL register.
//
//*****************************************************************************

#define ATCVL                         0x00007F80      // ATM Compare Value Low


//*****************************************************************************
//
// The following are defines for the bit fields in the MCG_C7 register.
//
//*****************************************************************************

#define OSCSEL                        0x00000001      // MCG OSC Clock Select


//*****************************************************************************
//
// The following are defines for the bit fields in the MCG_C8 register.
//
//*****************************************************************************

#define LOCRE1                        0x00000080      // Loss of Clock Reset Enable
#define CME1                          0x00000020      // Clock Monitor Enable1
#define LOCS1                         0x00000001      // RTC Loss of Clock Status


//*****************************************************************************
//
// The following are defines for the bit fields in the MCG_C10 register.
//
//*****************************************************************************

#define LOCRE2                        0x00000080      // OSC1 Loss of Clock Reset Enable
#define RANGE1                        0x00000060      // Frequency Range1 Select
#define HGO1                          0x00000008      // High Gain Oscillator1 Select
#define EREFS1                        0x00000004      // External Reference Select


//*****************************************************************************
//
// The following are defines for the bit fields in the MCG_C11 register.
//
//*****************************************************************************

#define PLLREFSEL1                    0x00000080      // PLL1 External Reference Select
#define PLLCLKEN1                     0x00000040      // PLL1 Clock Enable
#define PLLSTEN1                      0x00000020      // PLL1 Stop Enable
#define PLLCS                         0x00000010      // PLL Clock Select
#define PRDIV1                        0x0000001C      // PLL1 External Reference Divider


//*****************************************************************************
//
// The following are defines for the bit fields in the MCG_C12 register.
//
//*****************************************************************************

#define LOLIE1                        0x00000080      // PLL1 Loss of Lock Interrupt Enable
#define CME2                          0x00000020      // Clock Monitor Enable2
#define VDIV1                         0x000001F0      // VCO1 Divider


//*****************************************************************************
//
// The following are defines for the bit fields in the MCG_S2 register.
//
//*****************************************************************************

#define LOLS1                         0x00000080      // Loss of Lock Status
#define LOCK1                         0x00000040      // Lock Status
#define PLLCST                        0x00000010      // PLL Clock Select Status
#define OSCINIT1                      0x00000002      // OSC Initialization
#define LOCS2                         0x00000001      // OSC1 Loss of Clock Status


//*****************************************************************************
//
// The following are defines for the bit fields in the OSC0_CR register.
//
//*****************************************************************************

#define ERCLKEN                       0x00000080      // Enable External Reference Clock
#define EREFSTEN                      0x00000020      // Enable External Reference Clock Status
#define SC2P                          0x00000010      // Select Clock 2 Prescaler
#define SC4P                          0x00000008      // Select Clock 4 Prescaler
#define SC8P                          0x00000004      // Select Clock 8 Prescaler
#define SC16P                         0x00000002      // Select Clock 16 Prescaler


//*****************************************************************************
//
// The following are defines for the bit fields in the OSC1_CR register.
//
//*****************************************************************************

#define ERCLKEN                       0x00000080      // Enable External Reference Clock
#define EREFSTEN                      0x00000020      // Enable External Reference Clock Status
#define SC2P                          0x00000010      // Select Clock 2 Prescaler
#define SC4P                          0x00000008      // Select Clock 4 Prescaler
#define SC8P                          0x00000004      // Select Clock 8 Prescaler
#define SC16P                         0x00000002      // Select Clock 16 Prescaler


//*****************************************************************************
//
// The following are defines for the bit fields in the LMEM_PCCCR register.
//
//*****************************************************************************

