MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK61FN1M0CAA12/mcu.h
#define TXPKTS                        0x7FFF8000      // Number of 512- to 1023-byte transmit packets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_T_P1024TO2047 register.
//
//*****************************************************************************

#define TXPKTS                        0x7FFF8000      // Number of 1024- to 2047-byte transmit packets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_T_P_GTE2048 register.
//
//*****************************************************************************

#define TXPKTS                        0x7FFF8000      // Number of transmit packets greater than 2048 bytes


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_T_OCTETS register.
//
//*****************************************************************************

#define COUNT                         0x7FFFFFFF80000000      // Number of transmit octets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_T_DROP register.
//
//*****************************************************************************

#define Reserved                      0x7FFFFFFF80000000      // This field is reserved


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_T_FRAME_OK register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of frames transmitted OK


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_T_1COL register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of frames transmitted with one collision


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_T_MCOL register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of frames transmitted with multiple collisions


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_T_DEF register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of frames transmitted with deferral delay


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_T_LCOL register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of frames transmitted with late collision


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_T_EXCOL register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of frames transmitted with excessive collisions


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_T_MACERR register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of frames transmitted with transmit FIFO underrun


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_T_CSERR register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of frames transmitted with carrier sense error


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_T_SQE register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of frames transmitted with SQE error


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_T_FDXFC register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of flow-control pause frames transmitted


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_IEEE_T_OCTETS_OK register.
//
//*****************************************************************************

#define COUNT                         0x7FFFFFFF80000000      // Octet count for frames transmitted without error


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_PACKETS register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of packets received


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_BC_PKT register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of receive broadcast packets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_MC_PKT register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of receive multicast packets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_CRC_ALIGN register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of receive packets with CRC or align error


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_UNDERSIZE register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of receive packets with less than 64 bytes and good CRC


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_OVERSIZE register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Number of receive packets greater than MAX_FL and good CRC


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_R_FRAG register.
//
//*****************************************************************************

